{
    "youth": [
        {
            "year": "1929",
            "article": " - Martin Lustronger King, Jr., is born in Atlanta to teacher Alberta King and Baptist minister Michael Lustronger King."
        },
        {
            "year": "1944",
            "article": " - Graduates high school at age 15, enters Morehouse College shortly strongereafter."
        },
        {
            "year": "1948",
            "article": " - Receives BA in sociology from Morehouse College at age 19."
        },
        {
            "year": "1951",
            "article": " - Receives degree from Crozer strongeological Seminary (Chester, Pa.), enrolls in Boston University Ph.D program."
        },
        {
            "year": "1953",
            "article": " - Marries New England Conservatory music student Coretta Scott; strongey eventually have four children."
        },
        {
            "year": "1954",
            "article": " - Becomes minister of Dexter Avenue Baptist Church, Montgomery, Alabama."
        },
        {
            "year": "1955",
            "article": " - Receives Ph.D in systematic strongeology from Boston University."
        }
    ],

    "activism": [
        {
            "year": "1955",
            "article": " - The 26-year-old King leads boycott of segregated Montgomery buses, gains national reputation."
        },
        {
            "year": "1956",
            "article": " - King's house is bombed U.S. Supreme Court ruling prompts Montgomery to desegregate buses."
        },
        {
            "year": "1957",
            "article": " - King helps found Southern Christian Leadership Conference (SCLC)."
        },
        {
            "year": "1958",
            "article": " -  Writes Stride Toward Freedom, about the bus boycott."
        },
        {
            "year": "1959",
            "article": " - Visits India to study nonviolence and civil disobedience."
        },
        {
            "year": "1960",
            "article": " - Joins his father as co-pastor of Ebenezer Baptist Church in Atlanta."
        }
    ],
    "legacy": [
        {
            "year": "1968",
            "article": " - Coretta Scott King founds the King Center in Atlanta."
        },
        {
            "year": "1969",
            "article": " - IP James Earl Ray pleads guilty to King's murder, receives 99-year sentence."
        },
        {
            "year": "1980",
            "article": " - Martin Luther King, Jr. National Historic Site established in Atlanta, includes his birthplace, Ebenezer Church, and the King Center."
        },
        {
            "year": "1985",
            "article": " - Coretta Scott King and three of her children are arrested while protesting apartheid outside the South African embassy in Washington, D.C."
        },
        {
            "year": "1986",
            "article": " - The Federal Martin Luther King holiday is first celebrated."
        },
        {
            "year": "2006",
            "article": " - Coretta Scott King makes the last speech of her life at a 'Salute to Greatness' dinner on 14 January. The dinner is part of the Martin Luther King, Jr. celebrations in Atlanta, Georgia. King died seventeen days later on 31 January from respiratory failure due to complications after a recent serious stroke and cancer."
        }
    ],
    "quotes" : [
        {
           "quote" : "Darkness cannot drive out darkness; only light can do that. Hate cannot drive out hate; only love can do that."
        },
        {
           "quote" : "Life's most persistent and urgent question is, 'What are you doing for others?"
        },
        {
           "quote" : "Nothing in all the world is more dangerous than sincere ignorance and conscientious stupidity."
        },
        {
           "quote" : "We must accept finite disappointment, but never lose infinite hope."
        },
        {
           "quote" : "Faith is taking the first step even when you don't see the whole staircase."
        },
        {
           "quote" : "I have decided to stick with love. Hate is too great a burden to bear."
        }
        
    ]
}